app/Controllers/Company.php

SELECT *
FROM `company`
WHERE `companyID` = '1'
 LIMIT 1
---
    public function viewCompany($companyID)
    {
        $data = [];
        $data['page'] = 'Company Dashboard';

        $companyModel = new CompanyModel();
        $data['companyDetail'] = $companyModel->where('companyID', $companyID)->first();

SELECT *
FROM `company`
WHERE `companyID` = '1'
 LIMIT 1
---
    public function companyAnal($companyID)
    {
        $data = [];
        $data['page'] = 'Company Dashboard';

        $companyModel = new CompanyModel();
        $data['companyDetail'] = $companyModel->where('companyID', $companyID)->first();