app/Controllers/Users.php

    public function dashboard()
    {
        $aptModel = new AptModel();
        $aptArchiveDate = $aptModel->checkAptDate();

        foreach($aptArchiveDate as $aptDt){
            $aptArchivTime = $aptModel->checkAptTime($aptDt['aptID']);
            foreach($aptArchivTime as $aptTm){
                $newData = [
                    'aptID' => $aptTm['aptID'],
                    'aptStatus' => 'Cancelled',
                ];
                $aptModel->save($newData);
            }
        }

        if(!session('isLoggedIn'))
            return redirect()->to('/login');

        $data = [];

        $data['page'] = 'Dashboard';

        $userModel = new userModel();
        $data['user'] = $userModel->where('userID', session('userID'))->first();
---
SELECT *
FROM `user`
WHERE `userID` = '3'
 LIMIT 1