app/Models/CategoryModel.php

SELECT *
FROM `category`
---
    public function getCategoryList()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('category');
        return $builder->get()->getResultArray();