app/Models/CompanyModel.php

    public function getCompanyApp()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('company');
        $companyList = $builder->getWhere(['companyStatus'=>'Pending'])->getResultArray();
---
SELECT *
FROM `company`
WHERE `companyStatus` = 'Pending'