app/Models/UserModel.php

    public function getCustomerDetail($userID)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('customer');
        return $builder->getWhere(['userID' => $userID])->getRowArray();
---
SELECT *
FROM `customer`
WHERE `userID` = '3'